[
  {
    "title": "What is GSoC?",
    "content": "Google Summer of Code (GSoC) is a global program focused on bringing student developers into open source software development. Participants work on a 12-week programming project under the guidance of mentors from open source organizations."
  },
  {
    "title": "Who can participate in GSoC?",
    "content": "GSoC is open to students and new contributors to open source, including those who have never contributed before. Individuals must be at least 18 years old and meet the program's eligibility criteria."
  },
  {
    "title": "How do I apply for GSoC?",
    "content": "Visit the official GSoC website at https://summerofcode.withgoogle.com. Browse through the list of participating organizations, select a project idea, and submit a detailed proposal during the application period."
  },
  {
    "title": "What kind of projects are available in GSoC?",
    "content": "GSoC projects span various domains, including web development, machine learning, operating systems, and more. Each participating organization provides a list of project ideas for applicants to choose from."
  },
  {
    "title": "Do I need to know how to code to participate in GSoC?",
    "content": "Yes, GSoC is focused on programming and requires participants to have some level of coding knowledge. However, the required skill level depends on the project you choose."
  },
  {
    "title": "What is the timeline for GSoC?",
    "content": "GSoC typically runs annually, with applications opening early in the year. The coding period usually lasts 12 weeks, starting in May or June. Check the GSoC website for exact dates."
  },
  {
    "title": "How do I choose a project for GSoC?",
    "content": "Start by exploring the list of participating organizations and their project ideas. Look for a project that aligns with your skills and interests. Reach out to the organization's mentors for guidance before applying."
  },
  {
    "title": "What are the benefits of participating in GSoC?",
    "content": "GSoC provides an opportunity to gain real-world experience, contribute to open source, build professional networks, and receive a stipend for successful project completion."
  },
  {
    "title": "How do I prepare for GSoC?",
    "content": "Start by learning about open source and contributing to projects you're interested in. Familiarize yourself with Git and version control. Engage with open source communities and practice writing a strong project proposal."
  },
  {
    "title": "Where can I find more information about GSoC?",
    "content": "Visit the official GSoC website at https://summerofcode.withgoogle.com for detailed information about the program, timelines, and resources."
  }
]
