[
  {
    "title": "What is this Webinar about?",
    "content": "This webinar is an exclusive opportunity to gain live insights and inspiration from a GSoC winner. Get tailored strategies, insider tips for winning proposals, and real-life inspiration for kicking off your GSoC journey with the right guidance."
  },
  {
    "title": "Who is organizing this event?",
    "content": "The event is organized by FEDKIIT and features a GSoC alumnus sharing their expertise on how to take active participation in Google Summer of Code."
  },
  {
    "title": "When and where will the event be held?",
    "content": "The webinar will be conducted online on 10th January. Join us from the comfort of your home or hostel and get ready to learn directly from a GSoC alumnus."
  },
  {
    "title": "What is the fee for attending the event?",
    "content": "The event is paid, with a nominal registration fee of ₹49 to gain access to this invaluable session."
  },
  {
    "title": "What will I learn from this session?",
    "content": "The session will cover tailored strategies for GSoC, insider tips for crafting winning proposals, making impactful contributions, community engagement, strategic preparation, and more. Additionally, there will be an interactive real-time Q&A session."
  },
  {
    "title": "Why should I attend this webinar?",
    "content": "This session is a unique opportunity to learn from a GSoC alumnus who has firsthand experience in succeeding in the program. Gain practical insights, enhance your open source skills, and kickstart your journey with the right guidance."
  },
  {
    "title": "What is the highlight of this event?",
    "content": "The highlight is learning directly from a GSoC winner, gaining real-world inspiration, and interacting in real-time to clear your doubts and concerns about participating in GSoC."
  },
  {
    "title": "How do I register for this webinar?",
    "content": "Click on the 'Register Now' button on the event page and fill the form after completing the payment process to secure your spot in the webinar."
  },
  {
    "title": "What will be covered in the Q&A session?",
    "content": "The Q&A session will address participant queries related to preparing for GSoC, choosing projects, writing impactful proposals, and making meaningful contributions to open source communities."
  },
  {
    "title": "Where can I find more information about this webinar?",
    "content": "Stay tuned for updates on the official FEDKIIT website and social media handles. For any specific queries, you can reach out to the organizers directly."
  }
]
