[
  {
    "title": "How to register?",
    "content": "Be updated with our Instagram posts and FED site. A registration link will be provided once the registrations are on, or you can scan the QR code provided on our official Instagram account: https://www.instagram.com/fedkiit/."
  },
  {
    "title": "What is Omega?",
    "content": "Omega is FED’s flagship event consisting of four different segments, focusing on the development of entrepreneurship and other skills."
  },
  {
    "title": "Is it necessary that all the team members belong to KIIT only?",
    "content": "No, there is no such specific condition. You are free to select your teammates."
  },
  {
    "title": "What are the rewards?",
    "content": "We have exciting prizes for the winners. Be updated with all our announcements and discover for yourself what exciting things we have in store for you all."
  },
  {
    "title": "What exactly do we have to do in Pitchers?",
    "content": "Contestants will present their ideas in front of investors and other participants. It will be similar to Shark Tank, but here, even the participants can invest in other ideas."
  },
  {
    "title": "What is FPL?",
    "content": "It is an imitation of Indian Premier League cricket auctions."
  },
  {
    "title": "How is the Pitchers event this year different from that of the previous editions?",
    "content": "This time, the Pitchers can pitch as well as invest in other ideas."
  },
  {
    "title": "How to connect with the Organising Committee from the FED website?",
    "content": "Our website has all the info related to our members, and you can directly head to any of our members' social media accounts to connect with them. If you have any doubts, you can ask us on https://www.instagram.com/fedkiit/ or visit https://www.fedkiit.com/ (our official website)."
  },
  {
    "title": "Is it possible for a single participant to participate in all the events of Omega?",
    "content": "Yes, contestants can participate alone or as a team."
  },
  {
    "title": "How long will the events last on the given dates?",
    "content": "DATES: 25th and 26th of August. TIMINGS: 10:00 AM – 2:00 PM, 3:00 PM – 6:00 PM."
  },
  {
    "title": "Can the registration payment be done via the website?",
    "content": "Participants can register from the website itself."
  }
]

  