[
  {
    "quote": "It was a wonderful experience indeed and I am grateful to the opportunity provided. Helped me to brush up my old concepts and teach. Kudos to the entire team and all the members for a  seamless work. I thank you all and wish you all the very best! And ofc when needed, will always be there.",
    "title": "PRADIPTO CHOWDHURY",
    "post": "Instructor Skill Hunt 2.0"
  },
  {
    "quote": "I thank each and every single member present in this group who worked for this. To all my mates who prepared the content of the PPT and designed it so beautifully and so aligned and to all the other people who helped me out with different things. This won't happen without your hard work . So a big THANK YOU to each and every member who made this prompt engineering cohort a big one. Hats off to you all and Kudos to your hard work guys 👏💯🎉",
    "title": "NISHARG NARGUND",
    "post": "Instructors Skill Hunt 2.0"
  },
  {
    "quote": "The team absolutely crushed it at the Omega 3.0. All your contributions were like the secret sauce to our success. Please keep this good vibes rolling, believe in the power of the team. Always proud to call you guys my team, team FED 🥂. Also many congratulations to our new leads, make wise decisions. Do what's good for the team. Much love.",
    "title": "KHUSHALI VERMA",
    "post": "Ex Vice-President FED"
  },
  {
    "quote": "Working in FED I have learned that an Entrepreneur is not born, it's how we are built and are influenced by the people around us to be what we are. Being technical means reframing the world dynamically technical and supporting the entire team with all the knowledge you have gained and making things work with passion when the team needs it!",
    "title": "DIPANJAN BAKSHI",
    "post": "Ex Technical Director FED"
  },
  {
    "quote": "From sitting on the chair to reaching the chair itself I gained so much, I learnt so much and I saw FED grow and it's been one hell of a ride. Now I hope to contribute even more than what I have and make FED reach an all new level.",
    "title": "MAYANK KUMAR",
    "post": "Ex President FED"
  },
  {
    "quote": "Inside FED is a seemingly inexhaustible font of ideas which we use to reliably surprise and delight everyone. A creative mind can stimulate you to look at situations differently and come up with new solutions that go beyond and improve existing alternatives.",
    "title": "ANVESH PATHAK",
    "post": "Ex Director, Creative FED"
  },
  {
    "quote": "Witnessing your own growth is a beautiful sight. FED is that valuable sight for me, The society has contributed to overall development of confidence and my ability to learn. It helped me provide a vicinity to face Challenges and Working on them with the team has always been one of the perks of this place. I am earnestly grateful to serve as the President of the society and hope to go beyond to take FED to greater heights.",
    "title": "RISHABH KANT",
    "post": "Ex President FED"
  },
  {
    "quote": "The nature of being an entrepreneur means that you fully embrace ambiguity and are comfortable with being challenged regularly. Being an entrepreneur is more than being a business owner; it's a perspective and a lifestyle. Fed gave me that thing, that spark to grow my personality and lifestyle. Fed is not just an organization, but a family where I met amazing people, it gave me the best people, the best skills and the best life learnings.",
    "title": "NAVDEEP PAREWA",
    "post": "Ex Vice-President FED"
  },
  {
    "quote": "FED helped me advance to a new level by enabling me to go beyond simply learning to teach others. A layperson can just exclaim, \"Oh! What a gorgeous structure,\" or \"What a wonderful car,\" but only a creative person can make it look better. At FED, we prioritize providing the greatest platform to grow. Every year, FED expands significantly, therefore it is a privilege to share my experiences and continually contribute with even more passion to encourage entrepreneurship",
    "title": "RISHAV RAJ SINGH",
    "post": "Ex Technical Director FED"
  }
]
